Repository: AdibOmi/Pump-Fiction
Catalog: frontend/lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Pump Fiction
bn: পাম্প ফিকশন

source: Home
bn: হোম

source: Settings
bn: সেটিংস

source: Profile
bn: প্রোফাইল

source: Fitness
bn: ফিটনেস

source: Social
bn: সোশ্যাল

source: Chat
bn: চ্যাট

source: Marketplace
bn: মার্কেটপ্লেস

source: Appearance
bn: চেহারা

source: Dark Mode
bn: ডার্ক মোড

source: Language
bn: ভাষা

source: Select Language
bn: ভাষা নির্বাচন করুন

source: Cancel
bn: বাতিল

source: About
bn: সম্পর্কে

source: App Version
bn: অ্যাপের সংস্করণ

source: Dashboard
bn: ড্যাশবোর্ড

source: Your fitness dashboard will be here
bn: আপনার ফিটনেস ড্যাশবোর্ড এখানে থাকবে

source: Your fitness routines and exercises will be here
bn: আপনার ফিটনেস রুটিন এবং ব্যায়াম এখানে থাকবে

source: Shop for fitness equipment and supplements
bn: ফিটনেস সরঞ্জাম এবং পরিপূরক কিনুন

source: Menu
bn: মেনু

source: Logout
bn: লগআউট

source: Routine
bn: রুটিন

source: Workout
bn: ওয়ার্কআউট

source: Nutrition
bn: পুষ্টি

source: Progress
bn: অগ্রগতি

source: Workout Progress
bn: ওয়ার্কআউট অগ্রগতি

source: Graphs based on your logged workouts
bn: আপনার লগ করা ওয়ার্কআউটের উপর ভিত্তি করে গ্রাফ

source: Your Trackers
bn: আপনার ট্র্যাকার

source: Create custom trackers and log values
bn: কাস্টম ট্র্যাকার তৈরি করুন এবং মান লগ করুন

source: Feed
bn: ফিড

source: Create
bn: তৈরি

source: Search
bn: খুঁজুন

source: New Post
bn: নতুন পোস্ট

source: Create Routine
bn: রুটিন তৈরি করুন

source: Routine Title
bn: রুটিনের শিরোনাম

source: Plan Type
bn: পরিকল্পনার ধরণ

source: Weekly
bn: সাপ্তাহিক

source: Number of Days
bn: দিনের সংখ্যা

source: Days
bn: দিন

source: Rename Day
bn: দিনের নাম পরিবর্তন করুন

source: Day name
bn: দিনের নাম

source: Save
bn: সংরক্ষণ

source: Add Exercise
bn: ব্যায়াম যোগ করুন

source: Exercise name
bn: ব্যায়ামের নাম

source: sets
bn: সেট

source: Min reps
bn: সর্বনিম্ন রেপস

source: Max reps
bn: সর্বোচ্চ রেপস

source: Required
bn: প্রয়োজনীয়

source: Enter sets
bn: সেট লিখুন

source: Enter min
bn: সর্বনিম্ন লিখুন

source: Enter max
bn: সর্বোচ্চ লিখুন

# maxMustBeGreaterThanMin
source: Max must be >= min
bn: সর্বোচ্চ অবশ্যই সর্বনিম্নের চেয়ে বেশি বা সমান হতে হবে

source: Add
bn: যোগ করুন

source: No exercises yet
bn: এখনও কোনো ব্যায়াম নেই

source: Tap + to add exercises
bn: ব্যায়াম যোগ করতে + চাপুন

source: Exercises
bn: ব্যায়াম

source: No exercises yet. Tap 'Add exercise' to start.
bn: এখনও কোনো ব্যায়াম নেই। শুরু করতে 'ব্যায়াম যোগ করুন' চাপুন।

source: Save Day
bn: দিন সংরক্ষণ করুন

# addExerciseButton
source: Add exercise
bn: ব্যায়াম যোগ করুন

source: Our Programs
bn: আমাদের প্রোগ্রাম

source: Save Routine
bn: রুটিন সংরক্ষণ করুন

# howManyDaysIsYourProgram
source: How many days is your program (including rest days)?
bn: আপনার প্রোগ্রাম কতদিনের (বিশ্রামের দিনসহ)?

# saturday
source: Sat
bn: শনি

# sunday
source: Sun
bn: রবি

# monday
source: Mon
bn: সোম

# tuesday
source: Tue
bn: মঙ্গল

# wednesday
source: Wed
bn: বুধ

# thursday
source: Thu
bn: বৃহস্পতি

# friday
source: Fri
bn: শুক্র

# curatedPlansDescription
source: Curated plans (PPL, UL, Full-body)
bn: নির্বাচিত পরিকল্পনা (PPL, UL, Full-body)

source: Custom Routines
bn: কাস্টম রুটিন

source: Build your own weekly plan
bn: আপনার নিজস্ব সাপ্তাহিক পরিকল্পনা তৈরি করুন

source: Custom Programs
bn: কাস্টম প্রোগ্রাম

source: Add New Routine
bn: নতুন রুটিন যোগ করুন

source: Add Routine
bn: রুটিন যোগ করুন

source: Routine saved
bn: রুটিন সংরক্ষিত হয়েছে

source: Routine updated
bn: রুটিন আপডেট হয়েছে

# deleteRoutineQuestion
source: Delete routine?
bn: রুটিন মুছবেন?

# deleteRoutineContent
source: This will remove "{routineName}".
bn: এটি "{routineName}" সরিয়ে দেবে।

source: Delete
bn: মুছুন

source: Routine deleted
bn: রুটিন মুছে ফেলা হয়েছে

source: (Untitled)
bn: (শিরোনামহীন)

source: Edit
bn: সম্পাদনা

source: Start Workout
bn: ওয়ার্কআউট শুরু করুন

source: Share
bn: শেয়ার

source: Select Photo
bn: ছবি নির্বাচন করুন

source: Caption
bn: ক্যাপশন

source: Write a caption...
bn: একটি ক্যাপশন লিখুন...

source: Add Location
bn: অবস্থান যোগ করুন

source: Tag People
bn: মানুষদের ট্যাগ করুন

source: Take Photo
bn: ছবি তুলুন

source: Choose from Gallery
bn: গ্যালারি থেকে বেছে নিন

source: Location feature coming soon!
bn: অবস্থান ফিচার শীঘ্রই আসছে!

source: Tag people feature coming soon!
bn: মানুষদের ট্যাগ করার ফিচার শীঘ্রই আসছে!

source: Image selected successfully!
bn: ছবি সফলভাবে নির্বাচিত হয়েছে!

# errorSelectingImage
source: Error selecting image: {error}
bn: ছবি নির্বাচনে ত্রুটি: {error}

source: Please select an image first
bn: অনুগ্রহ করে প্রথমে একটি ছবি নির্বাচন করুন

source: Post created successfully!
bn: পোস্ট সফলভাবে তৈরি হয়েছে!

source: Workout date:
bn: ওয়ার্কআউটের তারিখ:

source: Pick your current routine
bn: আপনার বর্তমান রুটিন বেছে নিন

source: Which day are you training?
bn: আজ কোন দিনের ট্রেনিং করছেন?

source: Additional exercises
bn: অতিরিক্ত ব্যায়াম

source: Add Set
bn: সেট যোগ করুন

source: Weight
bn: ওজন

source: Reps
bn: রেপস

source: Finish Workout
bn: ওয়ার্কআউট শেষ করুন

source: Recent Workouts
bn: সাম্প্রতিক ওয়ার্কআউট

source: Workout Logged
bn: ওয়ার্কআউট লগ হয়েছে

source: Close
bn: বন্ধ

source: Target:
bn: লক্ষ্য:

source: Logged sets:
bn: লগ করা সেট:

# addSet2
source: Add set
bn: সেট যোগ করুন

source: Your routine has no exercises yet.
bn: আপনার রুটিনে এখনো কোনো ব্যায়াম নেই।

source: Log Today's workout
bn: আজকের ওয়ার্কআউট লগ করুন

source: Create a routine first
bn: প্রথমে একটি রুটিন তৈরি করুন

source: Add Additional Exercise
bn: অতিরিক্ত ব্যায়াম যোগ করুন

source: Enter weight
bn: ওজন লিখুন

source: Enter reps
bn: রেপস লিখুন

# noWorkoutsLoggedForDay
source: No workouts logged for {day} yet.
bn: {day} এর জন্য এখনো কোনো ওয়ার্কআউট লগ করা হয়নি।
